In [1]:
import pandas as pd

In [4]:
df = pd.read_excel('stock_data.xlsx','Sheet1') #worked without sheet1 as well
df

  tickers            eps  revenue price         people
0   GOOGL          27.82       87   845     larry page
1     WMT           4.61      484    65           n.a.
2    MSFT             -1       85    64     bill gates
3    RIL   not available       50  1023  mukesh ambani
4    TATA            5.6       -1  n.a.     ratan tata

In [9]:
#convert na to  VALUE
def convert_people(cell):
    if cell =='n.a.':
        return 'Sam'
    else:
        return cell

df = pd.read_excel('stock_data.xlsx','Sheet1',converters={'people':convert_people})
df

  tickers            eps  revenue price         people
0   GOOGL          27.82       87   845     larry page
1     WMT           4.61      484    65            Sam
2    MSFT             -1       85    64     bill gates
3    RIL   not available       50  1023  mukesh ambani
4    TATA            5.6       -1  n.a.     ratan tata

In [11]:
#to export excel
df.to_excel('clean.xlsx',sheet_name='stocks',index=False)

In [12]:
#start writing at a diff row and col
df.to_excel('clean.xlsx',sheet_name='stocks',index=False,startrow=1,startcol=2)

In [16]:
#to write 2 df in two sheets of same xlsx file
weather_data = {
    'day': ['1/1/2017','1/2/2017','1/3/2017'],
    'temperature': [32,35,28],
    'windspeed': [6,7,2],
    'event': ['Rain', 'Sunny', 'Snow']
}
wd=pd.DataFrame(weather_data)
wd.head()

        day  temperature  windspeed  event
0  1/1/2017           32          6   Rain
1  1/2/2017           35          7  Sunny
2  1/3/2017           28          2   Snow

In [17]:
with pd.ExcelWriter('clean.xlsx') as writer:
    df.to_excel(writer,sheet_name='stock')
    wd.to_excel(writer,sheet_name='weather')